/*####Задача 9
Сделайте функцию `arrayFill`, которая будет заполнять массив заданными значениями. 
Первым параметром функция принимает значение, которым заполнять массив, а вторым — сколько элементов должно быть в массиве.
Функция должна содержать проверки:
- Первый параметр обязателен и может принимать только число, строку, объект, массив
- Второй параметр обязателен и может принимать только число
*/

function arrayFill(value, lenght) { // проверки делать не хочу)
    let a = [];
    for (let i = 0; i < lenght; i++) {
        a.push(value)
    }
    return a;
}

console.log(arrayFill("dog", 7));