/*####Задача 8
Напишите функцию `f` . Данная функция принимает один параметр: одноуровневый или многоуровневый массив. Возвращает данная функция сумму всех элементов на всех уровнях.
Обратите внимание что функция должна возвращать число 0, если при проходе всех уровней не было найдено ни одного числа.
Функция должна содержать проверки:
- Первый параметр обязателен и может принимать только массив
- Генерировать ошибку если на каком то уровне было найдено не число и не массив*/

function f(array) {
    if (!Array.isArray(array)) {
        console.log("Первый параметр обязателен и может принимать только массив");
        return;
    }
    let sum = 0;
    for (let i = 0; i < array.length; i++) {
        if (Array.isArray(array[i])) {
            sum += f(array[i]);
        }
        if (typeof (array[i]) == 'number') {
            sum += array[i];
        }
    }
    return sum;
}
let a = [[[1, 2], [1, 2]], [['2', 1], [1, 2]]];
console.log(f(a));